JayHeng/RT-Mp4Player/boards/evkmimxrt1170/driver_examples/lpuart/interrupt_transfer_seven_bits/cm7/pin_mux.c
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_LPUART7_TXD, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_01_LPUART7_RXD, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_00_LPUART7_TXD, 0x10B0u);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_01_LPUART7_RXD, 0x10B0u);
}
